name: "Ball_RL"

input: "data"
input_dim:1
input_dim:1
input_dim:1
input_dim:100

layer {
  name: "output"
  type: "InnerProduct"
  bottom: "data"
  top: "output"
  param {
    lr_mult: 1
	decay_mult: 1
  }
  param {
    lr_mult: 2
	decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}